lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
#include <Arduino.h>
#include <string.h>

#include "nrf54l15_hal.h"
#include "zigbee_commissioning.h"
#include "zigbee_security.h"
#include "zigbee_stack.h"

#if defined(NRF54L15_CLEAN_ZIGBEE_ENABLED) && (NRF54L15_CLEAN_ZIGBEE_ENABLED == 0)
#error "Enable Tools > Zigbee Support to build ZigbeeHaCoordinatorJoinDemo."
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_CHANNEL
#define NRF54L15_CLEAN_ZIGBEE_CHANNEL 15
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_PAN_ID
#define NRF54L15_CLEAN_ZIGBEE_PAN_ID 0x1234
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_ALLOW_WELL_KNOWN_LINK_KEY
#define NRF54L15_CLEAN_ZIGBEE_ALLOW_WELL_KNOWN_LINK_KEY 1
#endif

#ifndef NRF54L15_CLEAN_ZIGBEE_REQUIRE_UNIQUE_LINK_KEY_FOR_REJOIN
#define NRF54L15_CLEAN_ZIGBEE_REQUIRE_UNIQUE_LINK_KEY_FOR_REJOIN 1
#endif

using namespace xiao_nrf54l15;

namespace {

static ZigbeeRadio g_radio;
static uint8_t g_macSequence = 1U;
static uint8_t g_nwkSequence = 1U;
static uint32_t g_nwkSecurityFrameCounter = 1U;
static uint32_t g_apsTrustCenterFrameCounter = 1U;
static uint8_t g_apsCounter = 1U;
static uint8_t g_zclSequence = 1U;
static uint8_t g_zdoSequence = 1U;
static uint32_t g_lastBeaconMs = 0U;
static uint32_t g_lastStatusMs = 0U;
static uint32_t g_permitJoinDeadlineMs = 0U;
static bool g_permitJoinEnabled = true;

static constexpr uint8_t kChannel =
    static_cast<uint8_t>(NRF54L15_CLEAN_ZIGBEE_CHANNEL);
static constexpr uint16_t kPanId =
    static_cast<uint16_t>(NRF54L15_CLEAN_ZIGBEE_PAN_ID);
static constexpr uint16_t kCoordinatorShort = 0x0000U;
static constexpr uint8_t kCoordinatorEndpoint = 1U;
static constexpr uint64_t kCoordinatorIeee = 0x00124B000054A11FULL;
static constexpr uint64_t kExtendedPanId = 0x00124B000054C0DEULL;
static uint8_t g_activeNetworkKeySequence = 0x01U;
static uint8_t g_activeNetworkKey[16] = {0xA1U, 0xB2U, 0xC3U, 0xD4U,
                                         0xE5U, 0xF6U, 0x07U, 0x18U,
                                         0x29U, 0x3AU, 0x4BU, 0x5CU,
                                         0x6DU, 0x7EU, 0x8FU, 0x90U};
static uint8_t g_alternateNetworkKeySequence = 0U;
static uint8_t g_alternateNetworkKey[16] = {0U};
static bool g_haveAlternateNetworkKey = false;
static constexpr uint8_t kMaxNodes = 8U;
static constexpr uint8_t kPendingPayloadMax = 96U;
static constexpr uint8_t kZclCommandConfigureReportingResponse = 0x07U;
static constexpr uint8_t kZclCommandReportAttributes = 0x0AU;
static constexpr uint8_t kZclCommandDefaultResponse = 0x0BU;
static constexpr uint8_t kOnOffCommandOff = 0x00U;
static constexpr uint8_t kOnOffCommandOn = 0x01U;
static constexpr uint8_t kOnOffCommandToggle = 0x02U;
static constexpr uint8_t kGroupsCommandAddGroup = 0x00U;
static constexpr uint8_t kLevelControlCommandMoveToLevelWithOnOff = 0x04U;
static constexpr uint8_t kLevelControlCommandStepWithOnOff = 0x06U;
static constexpr uint16_t kDemoGroupId = 0x1001U;
static constexpr uint32_t kPermitJoinWindowMs = 120000UL;
static const uint8_t kOnOffLightInstallCode[18] = {
    0x10U, 0xACU, 0x01U, 0x01U, 0x24U, 0x4BU, 0x00U, 0xA1U, 0xB2U,
    0xC3U, 0xD4U, 0xE5U, 0xF6U, 0x07U, 0x18U, 0x29U, 0x43U, 0x6AU};
static const uint8_t kDimmableLightInstallCode[18] = {
    0x10U, 0xACU, 0x02U, 0x01U, 0x24U, 0x4BU, 0x00U, 0xAAU, 0xBBU,
    0xCCU, 0xDDU, 0xEEU, 0xFFU, 0x11U, 0x22U, 0x33U, 0xFEU, 0xC9U};
static const uint8_t kTempSensorInstallCode[18] = {
    0x10U, 0xACU, 0x03U, 0x01U, 0x24U, 0x4BU, 0x00U, 0xCAU, 0xFEU,
    0xBAU, 0xBEU, 0x10U, 0x21U, 0x32U, 0x43U, 0x54U, 0xDCU, 0xB9U};

enum class NodeStage : uint8_t {
  kIdle = 0U,
  kAwaitingActiveEndpoints = 1U,
  kAwaitingSimpleDescriptor = 2U,
  kAwaitingBasicRead = 3U,
  kAwaitingReporting = 4U,
  kReady = 5U,
};

struct PendingApsFrame {
  bool used = false;
  uint8_t deliveryMode = kZigbeeApsDeliveryUnicast;
  uint16_t destinationGroup = 0U;
  uint16_t clusterId = 0U;
  uint16_t profileId = 0U;
  uint8_t destinationEndpoint = 0U;
  uint8_t sourceEndpoint = 0U;
  uint8_t payloadLength = 0U;
  uint8_t payload[kPendingPayloadMax] = {0U};
};

struct NodeEntry {
  bool used = false;
  uint64_t ieeeAddress = 0U;
  uint16_t shortAddress = 0U;
  uint32_t lastSeenMs = 0U;
  bool secureNwkSeen = false;
  uint32_t lastInboundSecurityFrameCounter = 0U;
  uint8_t currentNetworkKeySequence = 0U;
  bool pendingTransportKey = false;
  bool pendingNetworkKeyUpdate = false;
  bool pendingSwitchKey = false;
  bool pendingSecureRejoin = false;
  bool pendingAssociationResponse = false;
  uint16_t pendingAssignedShort = 0U;
  uint8_t pendingAssociationStatus = 0U;
  bool pendingApsAck = false;
  uint8_t pendingApsAckCounter = 0U;
  uint16_t pendingApsAckClusterId = 0U;
  uint16_t pendingApsAckProfileId = 0U;
  uint8_t pendingApsAckDestinationEndpoint = 0U;
  uint8_t pendingApsAckSourceEndpoint = 0U;
  uint32_t pendingApsAckDeadlineMs = 0U;
  PendingApsFrame pending{};
  bool announced = false;
  uint8_t endpoint = 0U;
  uint16_t profileId = 0U;
  uint16_t deviceId = 0U;
  bool supportsOnOff = false;
  bool supportsLevelControl = false;
  bool supportsIdentify = false;
  bool supportsTemperature = false;
  bool supportsPowerConfiguration = false;
  bool basicRead = false;
  bool onOffBindingConfigured = false;
  bool levelBindingConfigured = false;
  bool temperatureBindingConfigured = false;
  bool powerBindingConfigured = false;
  bool onOffReportingConfigured = false;
  bool levelReportingConfigured = false;
  bool temperatureReportingConfigured = false;
  bool powerReportingConfigured = false;
  bool awaitingBindResponse = false;
  uint16_t awaitingClusterId = 0U;
  bool haveOnOffState = false;
  bool onOffState = false;
  bool haveLevelState = false;
  uint8_t levelState = 0U;
  bool demoGroupConfigured = false;
  ZigbeePreconfiguredKeyMode preconfiguredKeyMode =
      ZigbeePreconfiguredKeyMode::kNone;
  NodeStage stage = NodeStage::kIdle;
};

static constexpr uint32_t kApsAckTimeoutMs = 900U;

static NodeEntry g_nodes[kMaxNodes] = {};
static uint16_t g_nextShortAddress = 0x1000U;

NodeEntry* findNodeByIeee(uint64_t ieeeAddress) {
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    if (g_nodes[i].used && g_nodes[i].ieeeAddress == ieeeAddress) {
      return &g_nodes[i];
    }
  }
  return nullptr;
}

NodeEntry* findNodeByShort(uint16_t shortAddress) {
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    if (g_nodes[i].used && g_nodes[i].shortAddress == shortAddress) {
      return &g_nodes[i];
    }
  }
  return nullptr;
}

NodeEntry* allocateNode(uint64_t ieeeAddress) {
  NodeEntry* existing = findNodeByIeee(ieeeAddress);
  if (existing != nullptr) {
    return existing;
  }

  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    if (!g_nodes[i].used) {
      memset(&g_nodes[i], 0, sizeof(g_nodes[i]));
      g_nodes[i].used = true;
      g_nodes[i].ieeeAddress = ieeeAddress;
      return &g_nodes[i];
    }
  }
  return nullptr;
}

uint16_t allocateShortAddress() {
  while (findNodeByShort(g_nextShortAddress) != nullptr ||
         g_nextShortAddress == 0x0000U || g_nextShortAddress == 0xFFFFU) {
    ++g_nextShortAddress;
  }
  return g_nextShortAddress++;
}

const uint8_t* findInstallCodeForNode(uint64_t ieeeAddress) {
  if (ieeeAddress == 0x00124B0001AC1001ULL) {
    return kOnOffLightInstallCode;
  }
  if (ieeeAddress == 0x00124B0001AC1002ULL) {
    return kDimmableLightInstallCode;
  }
  if (ieeeAddress == 0x00124B0001AC2001ULL) {
    return kTempSensorInstallCode;
  }
  return nullptr;
}

bool resolveTrustCenterLinkKey(NodeEntry* node, uint8_t outKey[16],
                               ZigbeePreconfiguredKeyMode* outMode) {
  if (node == nullptr || outKey == nullptr || outMode == nullptr) {
    return false;
  }

