lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
  const uint8_t* installCode = findInstallCodeForNode(node->ieeeAddress);
  if (installCode != nullptr &&
      ZigbeeSecurity::deriveInstallCodeLinkKey(installCode, 18U, outKey)) {
    *outMode = ZigbeePreconfiguredKeyMode::kInstallCodeDerived;
    return true;
  }

#if !NRF54L15_CLEAN_ZIGBEE_ALLOW_WELL_KNOWN_LINK_KEY
  return false;
#else
  if (!ZigbeeSecurity::loadZigbeeAlliance09LinkKey(outKey)) {
    return false;
  }
  *outMode = ZigbeePreconfiguredKeyMode::kWellKnown;
  return true;
#endif
}

bool secureRejoinAllowed(const NodeEntry* node) {
  if (node == nullptr) {
    return false;
  }
#if NRF54L15_CLEAN_ZIGBEE_REQUIRE_UNIQUE_LINK_KEY_FOR_REJOIN
  return ZigbeeCommissioning::isUniqueLinkKeyMode(node->preconfiguredKeyMode);
#else
  return node->preconfiguredKeyMode != ZigbeePreconfiguredKeyMode::kNone;
#endif
}

const uint8_t* keyForSequence(uint8_t keySequence) {
  if (keySequence == g_activeNetworkKeySequence) {
    return g_activeNetworkKey;
  }
  if (g_haveAlternateNetworkKey &&
      keySequence == g_alternateNetworkKeySequence) {
    return g_alternateNetworkKey;
  }
  return nullptr;
}

void clearAlternateNetworkKey() {
  memset(g_alternateNetworkKey, 0, sizeof(g_alternateNetworkKey));
  g_alternateNetworkKeySequence = 0U;
  g_haveAlternateNetworkKey = false;
}

bool deriveAlternateNetworkKey() {
  if (g_haveAlternateNetworkKey) {
    return true;
  }

  const uint8_t nextSequence =
      (g_activeNetworkKeySequence == 0xFFU)
          ? 0x01U
          : static_cast<uint8_t>(g_activeNetworkKeySequence + 1U);
  for (uint8_t i = 0U; i < sizeof(g_alternateNetworkKey); ++i) {
    g_alternateNetworkKey[i] =
        static_cast<uint8_t>(g_activeNetworkKey[i] ^
                             static_cast<uint8_t>(0x5AU + nextSequence +
                                                  (i * 3U)));
  }
  if (memcmp(g_alternateNetworkKey, g_activeNetworkKey,
             sizeof(g_alternateNetworkKey)) == 0) {
    g_alternateNetworkKey[0] ^= 0xA5U;
  }
  g_alternateNetworkKeySequence = nextSequence;
  g_haveAlternateNetworkKey = true;
  return true;
}

void maybePromoteAlternateNetworkKey() {
  if (!g_haveAlternateNetworkKey) {
    return;
  }

  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    if (!g_nodes[i].used || g_nodes[i].shortAddress == 0U) {
      continue;
    }
    if (g_nodes[i].currentNetworkKeySequence != g_alternateNetworkKeySequence) {
      return;
    }
  }

  memcpy(g_activeNetworkKey, g_alternateNetworkKey, sizeof(g_activeNetworkKey));
  g_activeNetworkKeySequence = g_alternateNetworkKeySequence;
  clearAlternateNetworkKey();
  Serial.print("nwk_key_promoted seq=");
  Serial.print(g_activeNetworkKeySequence);
  Serial.print("\r\n");
}

bool sendPsdu(const uint8_t* psdu, uint8_t length) {
  return g_radio.transmit(psdu, length, false, 1200000UL);
}

bool sendBeacon() {
  ZigbeeMacBeaconPayload payload{};
  payload.valid = true;
  payload.protocolId = 0U;
  payload.stackProfile = 2U;
  payload.protocolVersion = 2U;
  payload.panCoordinator = true;
  payload.associationPermit = g_permitJoinEnabled;
  payload.routerCapacity = true;
  payload.endDeviceCapacity = true;
  payload.extendedPanId = kExtendedPanId;
  payload.txOffset = 0x00FFFFFFUL;
  payload.updateId = 0U;

  uint8_t frame[127] = {0U};
  uint8_t length = 0U;
  if (!ZigbeeCodec::buildBeaconFrame(g_macSequence++, kPanId,
                                     kCoordinatorShort, payload, frame,
                                     &length)) {
    return false;
  }
  return sendPsdu(frame, length);
}

bool sendCoordinatorRealignment(NodeEntry* node) {
  if (node == nullptr || node->ieeeAddress == 0U || node->shortAddress == 0U) {
    return false;
  }

  uint8_t frame[127] = {0U};
  uint8_t length = 0U;
  if (!ZigbeeCodec::buildCoordinatorRealignment(
          g_macSequence++, kPanId, kCoordinatorShort, kChannel,
          node->shortAddress, node->ieeeAddress, frame, &length)) {
    return false;
  }
  return sendPsdu(frame, length);
}

bool queuePendingApsFrameExtended(NodeEntry* node, uint8_t deliveryMode,
                                  uint16_t destinationGroup,
                                  uint16_t clusterId, uint16_t profileId,
                                  uint8_t destinationEndpoint,
                                  uint8_t sourceEndpoint,
                                  const uint8_t* payload,
                                  uint8_t payloadLength) {
  if (node == nullptr) {
    return false;
  }
  if (payloadLength > 0U && payload == nullptr) {
    return false;
  }
  if (node->pendingAssociationResponse || node->pendingTransportKey ||
      node->pendingSwitchKey || node->pending.used ||
      payloadLength > kPendingPayloadMax) {
    return false;
  }

  node->pending.used = true;
  node->pending.deliveryMode = deliveryMode;
  node->pending.destinationGroup = destinationGroup;
  node->pending.clusterId = clusterId;
  node->pending.profileId = profileId;
  node->pending.destinationEndpoint = destinationEndpoint;
  node->pending.sourceEndpoint = sourceEndpoint;
  node->pending.payloadLength = payloadLength;
  if (payloadLength > 0U) {
    memcpy(node->pending.payload, payload, payloadLength);
  }
  return true;
}

bool queuePendingApsFrame(NodeEntry* node, uint16_t clusterId,
                          uint16_t profileId, uint8_t destinationEndpoint,
                          uint8_t sourceEndpoint, const uint8_t* payload,
                          uint8_t payloadLength) {
  return queuePendingApsFrameExtended(
      node, kZigbeeApsDeliveryUnicast, 0U, clusterId, profileId,
      destinationEndpoint, sourceEndpoint, payload, payloadLength);
}

void clearPendingApsAck(NodeEntry* node) {
  if (node == nullptr) {
    return;
  }
  node->pendingApsAck = false;
  node->pendingApsAckCounter = 0U;
  node->pendingApsAckClusterId = 0U;
  node->pendingApsAckProfileId = 0U;
  node->pendingApsAckDestinationEndpoint = 0U;
  node->pendingApsAckSourceEndpoint = 0U;
  node->pendingApsAckDeadlineMs = 0U;
}

void rememberPendingApsAck(NodeEntry* node, const ZigbeeApsDataFrame& aps) {
  if (node == nullptr || aps.deliveryMode != kZigbeeApsDeliveryUnicast ||
      !aps.ackRequested) {
    clearPendingApsAck(node);
    return;
  }
  node->pendingApsAck = true;
  node->pendingApsAckCounter = aps.counter;
  node->pendingApsAckClusterId = aps.clusterId;
  node->pendingApsAckProfileId = aps.profileId;
  node->pendingApsAckDestinationEndpoint = aps.destinationEndpoint;
  node->pendingApsAckSourceEndpoint = aps.sourceEndpoint;
  node->pendingApsAckDeadlineMs = millis() + kApsAckTimeoutMs;
}

bool matchesPendingApsAck(const NodeEntry& node,
                          const ZigbeeApsAcknowledgementFrame& ack) {
  return node.pendingApsAck && ack.valid && !ack.ackFormatCommand &&
         ack.counter == node.pendingApsAckCounter &&
         ack.clusterId == node.pendingApsAckClusterId &&
         ack.profileId == node.pendingApsAckProfileId &&
         ack.destinationEndpoint == node.pendingApsAckSourceEndpoint &&
         ack.sourceEndpoint == node.pendingApsAckDestinationEndpoint;
}

