lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
bool queueLevelMoveToLevel(NodeEntry* node, uint8_t level) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsLevelControl) {
    return false;
  }

  const uint8_t commandPayload[] = {level, 0x00U, 0x00U};
  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  ZigbeeZclFrame frame{};
  frame.frameType = ZigbeeZclFrameType::kClusterSpecific;
  frame.disableDefaultResponse = false;
  frame.transactionSequence = g_zclSequence++;
  frame.commandId = kLevelControlCommandMoveToLevelWithOnOff;
  if (!ZigbeeCodec::buildZclFrame(frame, commandPayload,
                                  static_cast<uint8_t>(sizeof(commandPayload)),
                                  payload, &payloadLength)) {
    return false;
  }

  return queuePendingApsFrame(node, kZigbeeClusterLevelControl,
                              kZigbeeProfileHomeAutomation, node->endpoint,
                              kCoordinatorEndpoint, payload, payloadLength);
}

bool queueLevelStep(NodeEntry* node, bool increase, uint8_t stepSize) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsLevelControl) {
    return false;
  }

  const uint8_t commandPayload[] = {
      static_cast<uint8_t>(increase ? 0x00U : 0x01U), stepSize, 0x00U, 0x00U};
  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  ZigbeeZclFrame frame{};
  frame.frameType = ZigbeeZclFrameType::kClusterSpecific;
  frame.disableDefaultResponse = false;
  frame.transactionSequence = g_zclSequence++;
  frame.commandId = kLevelControlCommandStepWithOnOff;
  if (!ZigbeeCodec::buildZclFrame(frame, commandPayload,
                                  static_cast<uint8_t>(sizeof(commandPayload)),
                                  payload, &payloadLength)) {
    return false;
  }

  return queuePendingApsFrame(node, kZigbeeClusterLevelControl,
                              kZigbeeProfileHomeAutomation, node->endpoint,
                              kCoordinatorEndpoint, payload, payloadLength);
}

bool queueAddGroup(NodeEntry* node, uint16_t groupId, const char* name) {
  if (node == nullptr || node->endpoint == 0U ||
      (!node->supportsOnOff && !node->supportsLevelControl)) {
    return false;
  }

  uint8_t commandPayload[32] = {0U};
  const uint8_t nameLength =
      (name == nullptr)
          ? 0U
          : static_cast<uint8_t>(strnlen(name, sizeof(commandPayload) - 3U));
  commandPayload[0] = static_cast<uint8_t>(groupId & 0xFFU);
  commandPayload[1] = static_cast<uint8_t>((groupId >> 8U) & 0xFFU);
  commandPayload[2] = nameLength;
  if (nameLength > 0U) {
    memcpy(&commandPayload[3], name, nameLength);
  }

  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  ZigbeeZclFrame frame{};
  frame.frameType = ZigbeeZclFrameType::kClusterSpecific;
  frame.disableDefaultResponse = false;
  frame.transactionSequence = g_zclSequence++;
  frame.commandId = kGroupsCommandAddGroup;
  if (!ZigbeeCodec::buildZclFrame(
          frame, commandPayload, static_cast<uint8_t>(3U + nameLength), payload,
          &payloadLength)) {
    return false;
  }

  return queuePendingApsFrame(node, kZigbeeClusterGroups,
                              kZigbeeProfileHomeAutomation, node->endpoint,
                              kCoordinatorEndpoint, payload, payloadLength);
}

bool queueGroupOnOffCommand(NodeEntry* node, uint16_t groupId,
                            uint8_t commandId) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsOnOff ||
      !node->demoGroupConfigured) {
    return false;
  }

  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  ZigbeeZclFrame frame{};
  frame.frameType = ZigbeeZclFrameType::kClusterSpecific;
  frame.disableDefaultResponse = true;
  frame.transactionSequence = g_zclSequence++;
  frame.commandId = commandId;
  if (!ZigbeeCodec::buildZclFrame(frame, nullptr, 0U, payload, &payloadLength)) {
    return false;
  }

  return queuePendingApsFrameExtended(
      node, kZigbeeApsDeliveryGroup, groupId, kZigbeeClusterOnOff,
      kZigbeeProfileHomeAutomation, 0U, kCoordinatorEndpoint, payload,
      payloadLength);
}

bool queueGroupLevelMoveToLevel(NodeEntry* node, uint16_t groupId,
                                uint8_t level) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsLevelControl ||
      !node->demoGroupConfigured) {
    return false;
  }

  const uint8_t commandPayload[] = {level, 0x00U, 0x00U};
  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  ZigbeeZclFrame frame{};
  frame.frameType = ZigbeeZclFrameType::kClusterSpecific;
  frame.disableDefaultResponse = true;
  frame.transactionSequence = g_zclSequence++;
  frame.commandId = kLevelControlCommandMoveToLevelWithOnOff;
  if (!ZigbeeCodec::buildZclFrame(frame, commandPayload,
                                  static_cast<uint8_t>(sizeof(commandPayload)),
                                  payload, &payloadLength)) {
    return false;
  }

  return queuePendingApsFrameExtended(
      node, kZigbeeApsDeliveryGroup, groupId, kZigbeeClusterLevelControl,
      kZigbeeProfileHomeAutomation, 0U, kCoordinatorEndpoint, payload,
      payloadLength);
}

bool queueGroupLevelStep(NodeEntry* node, uint16_t groupId, bool increase,
                         uint8_t stepSize) {
  if (node == nullptr || node->endpoint == 0U || !node->supportsLevelControl ||
      !node->demoGroupConfigured) {
    return false;
  }

  const uint8_t commandPayload[] = {
      static_cast<uint8_t>(increase ? 0x00U : 0x01U), stepSize, 0x00U, 0x00U};
  uint8_t payload[127] = {0U};
  uint8_t payloadLength = 0U;
  ZigbeeZclFrame frame{};
  frame.frameType = ZigbeeZclFrameType::kClusterSpecific;
  frame.disableDefaultResponse = true;
  frame.transactionSequence = g_zclSequence++;
  frame.commandId = kLevelControlCommandStepWithOnOff;
  if (!ZigbeeCodec::buildZclFrame(frame, commandPayload,
                                  static_cast<uint8_t>(sizeof(commandPayload)),
                                  payload, &payloadLength)) {
    return false;
  }

  return queuePendingApsFrameExtended(
      node, kZigbeeApsDeliveryGroup, groupId, kZigbeeClusterLevelControl,
      kZigbeeProfileHomeAutomation, 0U, kCoordinatorEndpoint, payload,
      payloadLength);
}

