lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/ZigbeeHaCoordinatorJoinDemo/ZigbeeHaCoordinatorJoinDemo.ino
bool queueDemoGroupEnrollment() {
  bool queuedAny = false;
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    NodeEntry& node = g_nodes[i];
    if (!node.used || node.shortAddress == 0U || node.endpoint == 0U ||
        node.demoGroupConfigured ||
        (!node.supportsOnOff && !node.supportsLevelControl)) {
      continue;
    }
    queuedAny = queueAddGroup(&node, kDemoGroupId, "DemoGrp") || queuedAny;
  }
  return queuedAny;
}

bool queueDemoGroupOnOff(uint8_t commandId) {
  bool queuedAny = false;
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    queuedAny = queueGroupOnOffCommand(&g_nodes[i], kDemoGroupId, commandId) ||
                queuedAny;
  }
  return queuedAny;
}

bool queueDemoGroupLevelMoveToLevel(uint8_t level) {
  bool queuedAny = false;
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    queuedAny =
        queueGroupLevelMoveToLevel(&g_nodes[i], kDemoGroupId, level) ||
        queuedAny;
  }
  return queuedAny;
}

bool queueDemoGroupLevelStep(bool increase, uint8_t stepSize) {
  bool queuedAny = false;
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    queuedAny =
        queueGroupLevelStep(&g_nodes[i], kDemoGroupId, increase, stepSize) ||
        queuedAny;
  }
  return queuedAny;
}

NodeEntry* firstOnOffNode() {
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    if (g_nodes[i].used && g_nodes[i].shortAddress != 0U &&
        g_nodes[i].supportsOnOff && g_nodes[i].endpoint != 0U) {
      return &g_nodes[i];
    }
  }
  return nullptr;
}

NodeEntry* firstLevelNode() {
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    if (g_nodes[i].used && g_nodes[i].shortAddress != 0U &&
        g_nodes[i].supportsLevelControl && g_nodes[i].endpoint != 0U) {
      return &g_nodes[i];
    }
  }
  return nullptr;
}

NodeEntry* firstJoinedNode() {
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    if (g_nodes[i].used && g_nodes[i].shortAddress != 0U) {
      return &g_nodes[i];
    }
  }
  return nullptr;
}

void updateNodeAttributeState(NodeEntry* node, uint16_t clusterId,
                              const ZigbeeAttributeValue& value,
                              uint16_t attributeId) {
  if (node == nullptr) {
    return;
  }

  if (clusterId == kZigbeeClusterOnOff && attributeId == 0x0000U &&
      value.type == ZigbeeZclDataType::kBoolean) {
    node->haveOnOffState = true;
    node->onOffState = value.data.boolValue;
    return;
  }

  if (clusterId == kZigbeeClusterLevelControl && attributeId == 0x0000U &&
      value.type == ZigbeeZclDataType::kUint8) {
    node->haveLevelState = true;
    node->levelState = value.data.u8;
  }
}

void applyReadAttributeState(NodeEntry* node, uint16_t clusterId,
                             const ZigbeeReadAttributeRecord* records,
                             uint8_t recordCount) {
  if (node == nullptr || records == nullptr) {
    return;
  }
  for (uint8_t i = 0U; i < recordCount; ++i) {
    if (records[i].status != 0x00U) {
      continue;
    }
    updateNodeAttributeState(node, clusterId, records[i].value,
                             records[i].attributeId);
  }
}

void applyReportedAttributeState(NodeEntry* node, uint16_t clusterId,
                                 const ZigbeeAttributeReportRecord* records,
                                 uint8_t recordCount) {
  if (node == nullptr || records == nullptr) {
    return;
  }
  for (uint8_t i = 0U; i < recordCount; ++i) {
    updateNodeAttributeState(node, clusterId, records[i].value,
                             records[i].attributeId);
  }
}

bool queueNextReportingStep(NodeEntry* node) {
  if (node == nullptr) {
    return false;
  }
  if (node->supportsOnOff && !node->onOffBindingConfigured) {
    return queueBindRequest(node, kZigbeeClusterOnOff);
  }
  if (node->supportsOnOff && !node->onOffReportingConfigured) {
    return queueOnOffConfigureReporting(node);
  }
  if (node->supportsLevelControl && !node->levelBindingConfigured) {
    return queueBindRequest(node, kZigbeeClusterLevelControl);
  }
  if (node->supportsLevelControl && !node->levelReportingConfigured) {
    return queueLevelConfigureReporting(node);
  }
  if (node->supportsTemperature && !node->temperatureBindingConfigured) {
    return queueBindRequest(node, kZigbeeClusterTemperatureMeasurement);
  }
  if (node->supportsTemperature && !node->temperatureReportingConfigured) {
    return queueTemperatureConfigureReporting(node);
  }
  if (node->supportsPowerConfiguration && !node->powerBindingConfigured) {
    return queueBindRequest(node, kZigbeeClusterPowerConfiguration);
  }
  if (node->supportsPowerConfiguration && !node->powerReportingConfigured) {
    return queuePowerConfigureReporting(node);
  }
  return false;
}

void printAttributeValue(const ZigbeeAttributeValue& value) {
  switch (value.type) {
    case ZigbeeZclDataType::kBoolean:
      Serial.print(value.data.boolValue ? "true" : "false");
      break;
    case ZigbeeZclDataType::kBitmap8:
    case ZigbeeZclDataType::kUint8:
      Serial.print(value.data.u8);
      break;
    case ZigbeeZclDataType::kBitmap16:
    case ZigbeeZclDataType::kUint16:
      Serial.print(value.data.u16);
      break;
    case ZigbeeZclDataType::kInt16:
      Serial.print(value.data.i16);
      break;
    case ZigbeeZclDataType::kUint32:
      Serial.print(value.data.u32);
      break;
    case ZigbeeZclDataType::kCharString:
      for (uint8_t i = 0U; i < value.stringLength; ++i) {
        Serial.print(value.stringValue[i]);
      }
      break;
    default:
      Serial.print("unsupported");
      break;
  }
}

void listNodes() {
  Serial.print("nodes\r\n");
  for (uint8_t i = 0U; i < kMaxNodes; ++i) {
    if (!g_nodes[i].used) {
      continue;
    }
    Serial.print(" slot=");
    Serial.print(i);
    Serial.print(" ieee=0x");
    Serial.print(static_cast<uint32_t>(g_nodes[i].ieeeAddress >> 32U), HEX);
    Serial.print(static_cast<uint32_t>(g_nodes[i].ieeeAddress & 0xFFFFFFFFUL), HEX);
    Serial.print(" short=0x");
    Serial.print(g_nodes[i].shortAddress, HEX);
    Serial.print(" ep=");
    Serial.print(g_nodes[i].endpoint);
    Serial.print(" dev=0x");
    Serial.print(g_nodes[i].deviceId, HEX);
    Serial.print(" onoff=");
    Serial.print(g_nodes[i].supportsOnOff ? "yes" : "no");
    Serial.print(" level=");
    Serial.print(g_nodes[i].supportsLevelControl ? "yes" : "no");
    Serial.print(" temp=");
    Serial.print(g_nodes[i].supportsTemperature ? "yes" : "no");
    Serial.print(" group=");
    Serial.print(g_nodes[i].demoGroupConfigured ? "0x1001" : "no");
    Serial.print(" lk=");
    Serial.print(
        ZigbeeCommissioning::keyModeName(g_nodes[i].preconfiguredKeyMode));
    Serial.print(" nwk_seq=");
    Serial.print(g_nodes[i].currentNetworkKeySequence);
    Serial.print(" nwk_sec=");
    Serial.print(g_nodes[i].secureNwkSeen ? "yes" : "no");
    Serial.print(" pending=");
    Serial.print((g_nodes[i].pending.used ||
                  g_nodes[i].pendingAssociationResponse ||
                  g_nodes[i].pendingTransportKey ||
                  g_nodes[i].pendingSwitchKey ||
                  g_nodes[i].pendingSecureRejoin)
                     ? "yes"
                     : "no");
    Serial.print(" state=");
    if (g_nodes[i].haveOnOffState) {
      Serial.print(g_nodes[i].onOffState ? "ON" : "OFF");
    } else {
      Serial.print("?");
    }
    if (g_nodes[i].supportsLevelControl) {
      Serial.print(" lvl=");
      if (g_nodes[i].haveLevelState) {
        Serial.print(g_nodes[i].levelState);
      } else {
        Serial.print("?");
      }
    }
    Serial.print("\r\n");
  }
}

